[
    {
    "id": 1,
    "title": "HTML for Beginners",
    "price": 2000,
    "description": "HTML is an acronym which stands for Hyper Text Markup Language which is used for creating web pages and web applications. Let's see what is meant by Hypertext Markup Language, and Web page.A text has a link within it, is a hypertext. Whenever you click on a link which brings you to a new webpage, you have clicked on a hypertext. HyperText is a way to link two or more web pages (HTML documents) with each other.A markup language is a computer language that is used to apply layout and formatting conventions to a text document. Markup language makes text more interactive and dynamic. It can turn text into images, tables, links, etc.",
    "category": "HTML",
    "image": "https://m.media-amazon.com/images/I/41-1hZyYXxL._SY200_.png",
    "rating": {
    "rate": 4.3,
    "count": 259
    }
    },
    {
    "id": 2,
    "title": "CSS for Beginners",
    "price": 2500,
    "description": "Cascading Style Sheets, fondly referred to as CSS, is a simple design language intended to simplify the process of making web pages presentable.CSS handles the look and feel part of a web page. Using CSS, you can control the color of the text, the style of fonts, the spacing between paragraphs, how columns are sized and laid out, what background images or colors are used, layout designs,variations in display for different devices and screen sizes as well as a variety of other effects.CSS is easy to learn and understand but it provides powerful control over the presentation of an HTML document. Most commonly, CSS is combined with the markup languages HTML or XHTML.",
    "category": "CSS",
    "image": "https://i.ytimg.com/vi/1Rs2ND1ryYc/maxresdefault.jpg",
    "rating": {
    "rate": 4.7,
    "count": 500
    }
    },
    {
    "id": 3,
    "title": "JS for Beginners",
    "price": 4500,
    "description": "JavaScript is a dynamic computer programming language. It is lightweight and most commonly used as a part of web pages, whose implementations allow client-side script to interact with the user and make dynamic pages. It is an interpreted programming language with object-oriented capabilities.JavaScript was first known as LiveScript, but Netscape changed its name to JavaScript, possibly because of the excitement being generated by Java. JavaScript made its first appearance in Netscape 2.0 in 1995 with the name LiveScript. The general-purpose core of the language has been embedded in Netscape, Internet Explorer, and other web browsers.",
    "category": "JS",
    "image": "https://www.internetacademy.co.in/_assets/img/what-you-can-do-with-javascript.jpg",
    "rating": {
    "rate": 4.1,
    "count": 430
    }
    },
    {
    "id": 4,
    "title": "PHP for Beginners",
    "price": 6500,
    "description": "PHP is an open-source server-side scripting language that many devs use for web development. It is also a general-purpose language that you can use to make lots of projects, including Graphical User Interfaces (GUIs).In this article, I will help you explore the world of PHP so you can learn how it works and its basic features. By the end, you will be able to write your first Hello World program in PHP.PHP is mostly used for making web servers. It runs on the browser and is also capable of running in the command line. So, if you don't feel like showing your code output in the browser, you can show it in the terminal.",
    "category": "PHP",
    "image": "https://www.fossmint.com/wp-content/uploads/2020/03/Best-PHP-Courses-for-Beginners.png",
    "rating": {
    "rate": 4.6,
    "count": 400
    }
    },
    {
    "id": 5,
    "title": "Laravel for Beginners",
    "price": 8000,
    "description": "Laravel is an open-source PHP framework, which is robust and easy to understand. It follows a model-view-controller design pattern. Laravel reuses the existing components of different frameworks which helps in creating a web application. The web application thus designed is more structured and pragmatic.Laravel offers a rich set of functionalities which incorporates the basic features of PHP frameworks like CodeIgniter, Yii and other programming languages like Ruby on Rails. Laravel has a very rich set of features which will boost the speed of web development.",
    "category": "Laravel",
    "image": "https://www.venturelessons.com/wp-content/uploads/2020/06/Laravel-courses.jpg",
    "rating": {
    "rate": 3.9,
    "count": 70
    }
    },
    {
    "id": 6,
    "title": "React for Beginners",
    "price": 9999,
    "description": "The React.js framework is an open-source JavaScript framework and library developed by Facebook. It’s used for building interactive user interfaces and web applications quickly and efficiently with significantly less code than you would with vanilla JavaScript.In React, you develop your applications by creating reusable components that you can think of as independent Lego blocks. These components are individual pieces of a final interface, which, when assembled, form the application’s entire user interface.React then figures out the least expensive way to patch the actual DOM with that update without rendering the actual DOM. As a result, React’s components and UIs very quickly reflect the changes since you don’t have to reload an entire page every time something updates.",
    "category": "React",
    "image": "https://www.cdmi.in/courses@2x/react-js-training-institute.jpg",
    "rating": {
    "rate": 4.9,
    "count": 400
    }
    },
    {
    "id": 7,
    "title": "Python for Beginners",
    "price": 10000,
    "description": "Python has become one of the most popular programming languages in the world in recent years. It's used in everything from machine learning to building websites and software testing. It can be used by developers and non-developers alike.Python, one of the most popular programming languages in the world, has created everything from Netflix’s recommendation algorithm to the software that controls self-driving cars. Python is a general-purpose language, which means it’s designed to be used in a range of applications, including data science, software and web development, automation, and generally getting stuff done.",
    "category": "Python",
    "image": "https://distancelearning-images.s3.eu-west-2.amazonaws.com/product-images/600-600/Python-for-Beginners-L3-1200x600.jpg",
    "rating": {
    "rate": 4.9,
    "count": 100
    }
    },
    {
    "id": 8,
    "title": "WordPress for Beginners",
    "price": 6500,
    "description": "At its core, WordPress is the simplest, most popular way to create your own website or blog. In fact, WordPress powers over 43.3% of all the websites on the Internet. Yes, more than one in four websites that you visit are likely powered by WordPress.On a slightly more technical level, WordPress is an open-source content management system licensed under GPLv2, which means that anyone can use or modify the WordPress software for free. A content management system is basically a tool that makes it easy to manage important aspects of your website like content without needing to know anything about programming.The end result is that WordPress makes building a website accessible to anyone – even people who aren’t developers.",
    "category": "WordPress",
    "image": "https://content.websitelibrary.com.au/sites/wsl/images/featured/wordpress-course-for-beginners.jpeg",
    "rating": {
    "rate": 4.3,
    "count": 203
    }
    },
    {
    "id": 9,
    "title": "Django for Beginners",
    "price": 9999,
    "description": "In this first Django article, we answer the question What is Django and give you an overview of what makes this web framework special? We'll outline the main features, including some of the advanced functionality that we won't have time to cover in detail in this module. We'll also show you some of the main building blocks of a Django application (although at this point you won't yet have a development environment in which to test it.",
    "category": "Django",
    "image": "https://d3mxt5v3yxgcsr.cloudfront.net/courses/10590/course_10590_image.png",
    "rating": {
    "rate": 4.9,
    "count": 470
    }
    }
    ]